# Dataframe

*Cominations of Series*

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "Name" : ["Tejas", "Akash", "Suraj"],
    "Age" : [24, 23, 25],
    "City" : ["Nagpur", "Pune", "Akola"],
    "Salary" : [170000, 130000, 120000]
}
df = pd.DataFrame(data)
df

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [3]:
data_list = [
    ["Tejas", 24, "Nagpur", 170000],
    ["Akash", 23, "Pune", 130000],
    ["Suraj", 25, "Akola", 120000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

**Selection and Indexing of Columns**

In [4]:
df2

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [5]:
df2[["Name", "City"]]

    Name    City
0  Tejas  Nagpur
1  Akash    Pune
2  Suraj   Akola

**Creating a new column**

In [6]:
df2["Designation"] = ["Data Engineer", "SD Engineer", "ML Engineer"]
df2

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    ML Engineer

**Removing Columns**

In [7]:
df2.drop(0, axis=0)

    Name  Age   City  Salary  Designation
1  Akash   23   Pune  130000  SD Engineer
2  Suraj   25  Akola  120000  ML Engineer

In [8]:
df2

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    ML Engineer

In [9]:
df2.drop("Designation", axis=1)
df2

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    ML Engineer

In [10]:
df2.drop(0, axis=0)

    Name  Age   City  Salary  Designation
1  Akash   23   Pune  130000  SD Engineer
2  Suraj   25  Akola  120000  ML Engineer

**Selecting Rows**

In [11]:
df2

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    ML Engineer

In [ ]:
df2.loc[0]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer

In [14]:
df2.loc[[0,1]]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer

In [17]:
df.iloc[0]

Name       Tejas
Age           24
City      Nagpur
Salary    170000
Name: 0, dtype: object

**Selecting Subsets of Rows and Columns**

In [18]:
df.loc[[0,1], ["Name", "City"]]

    Name    City
0  Tejas  Nagpur
1  Akash    Pune

**Conditional Selection**

In [19]:
df2

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    ML Engineer

In [21]:
# I Only want to see those rows where Age is greater than 23
df2[df2["Age"] > 23]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
2  Suraj   25   Akola  120000    ML Engineer